app/controllers/index_controller.rb

SELECT "notes".* FROM "notes" ORDER BY "notes"."add_date" DESC LIMIT ?  [["LIMIT", 5]]
SELECT "notes"."key" FROM "notes"
SELECT "notes"."scale" FROM "notes"
SELECT "tunes"."rhythm" FROM "tunes"
---
  def index
  @recents = Note.order(add_date: :desc).limit(5)
  @keys = ["all"].concat(Note.pluck(:key).uniq)
  @scales = ["all"].concat(Note.pluck(:scale).uniq)
  @rhythms = ["all"].concat(Tune.pluck(:rhythm).uniq)