app/controllers/notes_controller.rb

  def new
    @note = Note.new
    @tune = Tune.find(params[:tune_id])
---
SELECT "tunes".* FROM "tunes" WHERE "tunes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @ref = params[:ref]
    @note = Note.find(params[:id])
    @note.assign_attributes(note_params)
    if @note.save
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "updated_at" = ?, "status" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-05 12:12:08.683038"], ["status", "draft"], ["id", 5]]