app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT ?  [["login_id", "guest "], ["LIMIT", 1]]
---
  def create
    user = User.find_by(login_id: params[:login_id])