app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "ksis"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(user_id: params[:user_id])