app/controllers/tunes_controller.rb

  def index
    if params[:tune_name].blank? && params[:user_name].blank? && params[:key] == "all" && params[:scale] == "all" && params[:rhythm] == "all"
      @tunes = Tune.order("name")
---
SELECT "tunes".* FROM "tunes" WHERE (key 'D' INNERJOIN notes ON tunes.id = notes.tune_id) ORDER BY name

  def show
    @tune = Tune.find(params[:id])
    @note = @tune.notes.where(status: "public")
---
SELECT "tunes".* FROM "tunes" WHERE "tunes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."tune_id" = ? AND "notes"."status" = ?  [["tune_id", 1], ["status", "public"]]

  def edit
    @tune = Tune.find(params[:id])
---
SELECT "tunes".* FROM "tunes" WHERE "tunes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @tune = Tune.find(params[:id])
    @tune.assign_attributes(tune_params)
    if @tune.save
---
SELECT "tunes".* FROM "tunes" WHERE "tunes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tunes" SET "memo" = ?, "updated_at" = ? WHERE "tunes"."id" = ?  [["memo", ""], ["updated_at", "2023-09-04 13:17:51.104167"], ["id", 2]]