app/controllers/users_controller.rb

  def edit
    @user = User.find_by(user_id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "guest"], ["LIMIT", 1]]