app/controllers/users_controller.rb

  def info
    @user = User.find(params[:id])
    @note = Note.where(user_id: params[:id]).where(status: "public")
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."status" = ?  [["user_id", 1], ["status", "public"]]

  def show
    @user = User.find(params[:id])
    @note = Note.where(user_id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def edit
    @user = User.find_by(login_id: session[:login_id])
---
SELECT "users".* FROM "users" WHERE "users"."login_id" = ? LIMIT ?  [["login_id", "guest"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "pref", "date", "memo", "created_at", "updated_at", "password_digest", "remember_digest", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @user.assign_attributes(user_params)
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "memo" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["memo", ""], ["updated_at", "2023-09-05 12:29:32.689191"], ["id", 3]]